In [ ]:
### pivot
- 데이터 프레임에서 특정 컬럼을 index, column, values 로 선택해서 데이터 프레임을 만드는 방법
- pivot
- pivot_table

In [31]:
# 타이타닉 데이터 load

ModuleNotFoundError: No module named 'pandars'

In [20]:
titanic = pd.read_csv("datas/train.csv")
titanic.tail(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [4]:
titanic["count"] = 1
titanic.tail(2)

In [ ]:
# index : 생존, column : 성별, value : sum(count)

In [13]:
df = titanic.pivot_table("count", "Survived", "Sex",aggfunc=np.sum)
df

Sex       female  male
Survived
0             81   468
1            233   109

In [15]:
df ["total"] = df["female"] + df["male"]
df

Sex       female  male  total
Survived
0             81   468    549
1            233   109    342

In [18]:
df.loc["total"] = df.loc[0] + df.loc[1]
df

Sex       female  male  total
Survived
0             81   468    549
1            233   109    342
2            314   577    891
total        314   577    891

In [35]:
# 컬럼 필터링
resule_df = titanic[["Survived","Pclass","Age","SibSp","Parch","Fare","Sex","Embarked"]]
resule_df.tail(2)

     Survived  Pclass   Age  SibSp  Parch   Fare   Sex Embarked
889         1       1  26.0      0      0  30.00  male        C
890         0       3  32.0      0      0   7.75  male        Q

In [41]:
resule_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 712 entries, 0 to 890
Data columns (total 8 columns):
Survived    712 non-null int64
Pclass      712 non-null int64
Age         712 non-null float64
SibSp       712 non-null int64
Parch       712 non-null int64
Fare        712 non-null float64
Sex         712 non-null object
Embarked    712 non-null object
dtypes: float64(2), int64(4), object(2)
memory usage: 50.1+ KB

In [40]:
resule_df.dropna(inplace=True)

/Users/MACPRO/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [39]:
result_df

NameError: name 'result_df' is not defined

In [43]:
onhot_sex = pd.get_dummies(result_df["Sex"])
onhot_embarked = pd.get_dummies(result_df["Embarked"])
outgot_embarked

NameError: name 'result_df' is not defined